blog/killer_features.html
<html>
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>Киллер-фичи Erlang</title>
    <link rel="stylesheet" type="text/css" href="../css/bootstrap.min.css" />
    <link rel="stylesheet" type="text/css" href="../css/main.css" />
    <link rel="stylesheet" href="../css/hl_styles/default.css">
  </head>
<body>

  <div id="header">
    <div id="main_title">
      <a href="../blog.html" style="color:#013;">Про Erlang и про всякое</a>
    </div>
    <div id="profile_link">
      <a href="https://plus.google.com/u/0/+YuriZhloba/about" style="color:#013;">Юра Жлоба</a>
    </div>
  </div>

<div id="content">

<h1>Киллер-фичи Erlang</h1>
<p><i>26 октября 2014</i><p>

<p>
Вчера выступил на 2-м митапе FuncBy, опять рассказал про
Erlang. Очередной вводный доклад, каких было уже несколько штук.
Не хотел совсем уж повторяться, добавил кое-что свежее.
</p>

<h2>Потоки в Erlang, немного бенчмарков и цифр</h2>
<p>
Про легковесные потоки, и про то, как их много можно создать, я думаю, вы наслышаны.
</p>

<p>
А давайте выясним, что значит эта "легковесность" в конкретных цифрах?
И сколько конкретно потоков можно создать?
</p>

<p>
Начнем со второго вопроса.
</p>

<p>
В документации по <a href="http://www.erlang.org/doc/man/erl.html">erl</a>, в разделе <b>Emulator Flags</b> описан флаг <b>+P</b>, устанавливающий
лимит на число потоков. И там сказано, что можно задавать значения в диапазоне
1024 - 134,217,727 (2^10 - 2^27), и дефолтное значение 262,144 (2^18)
</p>

<p>
134 миллиона потоков &#x2013; этого вполне хватит :) А вот дефолтных 260 тыс может и не хватить.
Для бенчмарков не хватит, так что будем запускать erl с этим флагом, задавая лимит
побольше.
</p>

<p>
Бенчмарк я сделал вот такой:
</p>

<div class="org-src-container">

<pre><code class="erl">-module(test).
-export([test/1, start/1, do_some_work/1]).

test(Num) -&gt;
    {Time, ok} = timer:tc(?MODULE, start, [Num]),
    NumProcesses = erlang:system_info(process_count),
    {Time, NumProcesses}.

start(Num) -&gt;
    [spawn_link(?MODULE, do_some_work, [N]) || N &lt;- lists:seq(0, Num)],
    ok.

do_some_work(_N) -&gt;
    timer:sleep(20000),
    done.
</code></pre>
</div>

<p>
Тут создается нужное к-во потоков, каждый из них просто висит 20
секунд в функции <b>do_some_work</b>, и потом завершается. Время,
потраченное на запуск всех этих потоков меряется с помощью
<b>timer:tc</b>. После чего проверяем, сколько всего потоков есть на ноде,
чтобы убедиться, что все запущенные потоки живы.
</p>

<p>
Для чистоты эксперимента, чтобы разные запуски теста не мешали друг другу,
мы будем каждый раз заново запускать ноду, причем вот такой командой:
</p>

<div class="org-src-container">

<pre><code class="erl">erl +P 1048576
</code></pre>
</div>

<p>
То есть, увеличиваем лимит потоков до 1 миллиона (точнее до 2^20,
ибо значение нужно округлять к степени двойки).
</p>

<p>
Тестирую на ноутбуке Thinkpad T520, 4 ядра Intel Core i5, 2.50GHz,
4Gb оперативной памяти, из которых свободны 2Gb.
</p>

<p>
И вот результаты:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Число потоков</th>
<th scope="col" class="left">Время запуска</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">200K</td>
<td class="left">0.7 секунды</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">400K</td>
<td class="left">2 секунды</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">600K</td>
<td class="left">2.8 секунды</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">800K</td>
<td class="left">11.7 секунд</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">1M</td>
<td class="left">20 секунд</td>
</tr>
</tbody>
</table>

<p>
Видим, что при количестве потоков 200К-600К новый поток стартует за 3-5 микросекунд.
При 800К-1М это дело замедляется, но это из-за того, что тут уже не хватает оперативной
памяти.
</p>

<p>
Давайте посмотрим, что с расходом памяти. Для этого используем другой тест:
</p>

<div class="org-src-container">

<pre><code class="erl">-module(test2).
-export([start/1, do_some_work/1]).

start(Num) -&gt;
    [spawn_link(?MODULE, do_some_work, [N]) || N &lt;- lists:seq(0, Num)],
    ok.

do_some_work(_N) -&gt;
    Info = process_info(self(), [total_heap_size, heap_size, stack_size]),
    io:format("~p ~p~n", [self(), Info]),
    done.
</code></pre>
</div>

<p>
Все просто, запускаем поток и с помощью <b>process_info</b> смотрим его статистику.
Видим такое:
</p>

<div class="org-src-container">

<pre><code class="erl">[{total_heap_size,233},
 {heap_size,233},
 {stack_size,1},
 {memory,2696}]
</code></pre>
</div>

<p>
На старте поток получает стек размером в 1 машинное слово, и кучу
размером в 233 машинных слова.  (Машинное слово зависит от архитектуры
и платформы, в моем 64-разрядном линуксе это 8 байт).  Всего новый
поток занимает 2696 байт, включая стек, кучу и память под свои
метаданные.
</p>

<p>
Ну а чтобы запустить миллион потоков нужно 2.5 Гб. У меня свободных
было только 2 Гб, из-за этого и были тормоза.
</p>

<p>
Теперь мы знаем, что такое "легковестный поток". Это запуск за 3-5
микросекунд и расход памяти 2.5 Кб на поток.
</p>

<p>
Всеми этими потоками управляют планировщики виртуальной машины.
Их несколько, по одному на каждое ядро процессора.
Желающие подробностей могут посмотреть вебинар
<a href="https://www.youtube.com/watch?v=tBAM_N9qPno">Lukas Larsson - Understanding the Erlang Scheduler</a>.
</p>

<p>
Я только отмечу, что планировщики умеюют балансировать нагрузку,
перераспределяя потоки между собой. У них нет задачи постоянно
держать равномерную нагрузку на все ядра процессоров, но есть
задача избежать больших перекосов, когда одно ядро загружено
на 100%, а другое вообще простаивает.
</p>

<h2>Надежность, уровни изоляции ошибок</h2>
<p>
IT индустрия пока не научилась создавать код без ошибок. Но научилась
худо-бедно с ними жить.
</p>

<p>
Никто не хочет, чтобы рухнула вся нода из-за ошибки в обработке
какого-то одного запроса.  Большинство языков для этого предлагает
механизм исключений. И разработчик может получить относительно
безопасный код, если правильно расставит try&#x2026;catch и правильно
обработает ошибки.
</p>

<p>
В Erlang это тоже есть, но это только первый уровень изоляции
ошибок. И он довольно редко используется, из-за того, что другие
уровни работают хорошо.
</p>

<p>
Вторым уровнем является дерево супервизоров. В Erlang есть специальные
потоки, которые сами не выполняют полезной работы, а наблюдают за
другими.  Такие специальные потоки называются <b>supervisor</b>
(наблюдатели). Ну а потоки, которые выполняют реальную работу,
называются <b>worker</b> (рабочие).
</p>

<p>
Если в рабочем потоке возникает ошибка, он аварийно
завершается. Супервизор получает об этом сообщение, и может принять
какие-то меры. Стандартная мера &#x2013; логировать ошибку и перезапустить
рабочий поток заново. При этом мы имеем небольшие потери (текущее
состояние потока), но можем продолжать работу.
</p>

<p>
Супервизоры наблюдают не только за рабочими процессами, но и друг за
другом. Для этого все потоки организованы в дерево, где узлами
являются супервизоры, а листьями &#x2013; рабочие потоки.
</p>

<p>
В более сложной ситуации можно перегрузить всю ветвь дерева,
выше и выше по уровню. И, наконец, все дерево целиком.
</p>

<p>
Третий уровень изоляции ошибок &#x2013; объединение нод в кластер.
Если нода все-таки падает, или вообще сервер выходит из строя
из-за проблем с железом, то ее функцию может взять на себя
резервная нода.
</p>

<p>
Программировать распределенные системы сложно на любом языке. Но
Erlang делает это немного проще, т.к. изначально разрабатывался для
этого.
</p>

<h2>Отладка работающией ноды в продакшене</h2>
<p>
Легковестные потоки и отравка сообщений, мониторинг потоков и супервизоры,
резервные узлы и кластеры &#x2013; все это так или иначе доступно и в других языках.
Где-то проще реализовать, где-то сложнее, но возможно.
</p>

<p>
Но есть кое-что в Erlang, что повторить в других языках очень сложно.
</p>

<p>
Есть возможность подключиться к работающей ноде,
выполнять из консоли любой код, и модифицировать код налету.
</p>

<p>
Есть встроенный на самом низком уровне механизм трассировки, мало
влияющий на общую производительность системы. Поэтому его можно
использовать на живой, продакшен системе.
</p>

<p>
Этот механизм позволяет получать в реальном времени информацию:
</p>
<ul class="org-ul">
<li>жизненный цикл процессов (старт, остановка, связи с другими процессами);
</li>
<li>отправка и получение сообщений;
</li>
<li>вызовы функций, аргументы, возвращаемые значения, откуда вызвана;
</li>
<li>наблюдать состояние процессов, и менять его;
</li>
<li>информацию о работе планировщика;
</li>
<li>информацию о потреблении памяти и работе сборщиков мусора.
</li>
</ul>

<p>
Теоретически можно узнать почти все о работе ноды. Практически этой информации
очень много, и нужно уметь выбрать именно ту, которая важна :)
</p>

<p>
Данные трассировки можно наблюдать в консоли, или перенаправить в файл,
или в свой обработчик. Ее можно получать на той же ноде, или перенаправить
на другую ноду, и обрабатывать и анализировать там.
</p>

<h2>И пару слов о памяти и сборке мусора</h2>
<p>
Сборка мусора в функциональных языках несколько проще, чем в императивных,
благодаря неизменяемым переменным. Из-за этого точно известно, что переменные,
созданные раньше, не могут указывать на объекты, созданные позже.
</p>

<p>
Сборщик мусора в Erlang делит объекты на два поколения: молодые и старые.
И исходит из предположения, что большинство молодых объектов являются
короткоживущими, и для них память нужно чистить чаще. А большинство
старых объектов являются долгоживущими, и для них память можно чистить реже.
</p>

<p>
Все это никакая не находка, аналогичные подходы приняты и в других языках.
Но фишка Erlang в том, что у него отдельный сборщик мусора для каждого потока.
И это дает интересные эффекты:
</p>

<p>
Нет эффекта stop world, как в JVM, когда сборщик мусора нужно
остановить всю ноду для своей работы. В Erlang все сборщики работают независимо
друг от друга, в разные моменты времени, и останавливают только свой поток.
</p>

<p>
Если поток короткоживущий (что довольно обычно для Erlang),
то после его завершения вся память потока целиком освобождается,
а сборщик мусора даже не успевает поработать.
</p>

<p>
Если поток долгоживущий, но потребляет мало памяти (типично для супервизора
и других потоков, выполняющих "менеджерские" задачи), то в нем сборщик
мусора запускается очень редко, или никогда.
</p>

<p>
В результате сборка мусора оказывает мало влияния на производительность системы.
</p>


<div id="disqus_thread"></div>
<script type="text/javascript">
var disqus_shortname = 'yzh44yzh';

(function() {
var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</body>
</html>
